# Vandam's Brewfile

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-drivers"

cask_args appdir: "/Applications"

brew "bitwarden-cli"
brew "starship"
brew "tree"
brew "zola"
brew "neofetch"
brew "mas"
brew "pyenv"
brew "python"
brew "pyenv"
brew "rust"
brew "node"
brew "emacs-plus"

cask "altserver"
cask "balenaetcher"
cask "cron"
cask "dozer"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "jabref"
cask "karabiner-elements"
cask "keka"
cask "mouse-fix"
cask "microsoft-excel"
cask "notion"
cask "obsidian"
cask "prismlauncher"
cask "pictogram"
cask "raycast"
cask "shottr"
cask "skim"
cask "spotify"
cask "steelseries-exactmouse-tool"
cask "todoist"
cask "wooshy"

mas "Craft", id: 1487937127
mas "Pure Paste", id: 1611378436
