# Vandam's Brewfile

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

# CLI Tools
brew "mas"                          # Mac App Store CLI
brew "starship"                     # Minimal Shell Prompt
brew "bitwarden-cli"                # Password Manager
brew "zola"                         # Static Site Generator
brew "pyenv"                        # Python Version Manager
brew "python"                       # Python
brew "thefuck"                      # Corrects Mistyped Commands
brew "stow"                         # Symlink Manager

# Applications
cask "arc"                          # Browser
cask "iterm2"                       # Terminal
cask "obsidian"                     # Note Taking App
cask "spotify"                      # Music
cask "visual-studio-code"           # IDE
cask "figma"                        # Design

# Tools/Misc
cask "dozer"                        # Hide Menu Bar Icons
cask "imageoptim"                   # Image Optimiser Tool
cask "inkscape"                     # Drawing Tool
cask "karabiner-elements"           # Keyboard Re-mapper
cask "keka"                         # Archiver
cask "pictogram"                    # App Icon Changer
cask "raycast"                      # Spotlight Alternative
cask "shottr"                       # Screenshot Tool
cask "skim"                         # PDF Reader
cask "steelseries-exactmouse-tool"  # Raw Mouse Acceleration
cask "font-fira-code-nerd-font"     # Terminal Font
cask "omnidisksweeper"              # Storage Tool
cask "zotero"                       # Reference Manager

# App Store
mas "Pure Paste", id: 1611378436    # Clipboard Manager
mas "Sleeve", id: 1606145041        # Mini Player
